def win():
    win_coord = [((0, 0), (0, 1), (0, 2)),
                 ((1, 0), (1, 1), (1, 2)),
                 ((2, 0), (2, 1), (2, 2)),
                 ((0, 2), (1, 1), (2, 0)),
                 ((0, 0), (1, 1), (2, 2)),
                 ((0, 0), (1, 0), (2, 0)),
                 ((0, 1), (1, 1), (2, 1)),
                 ((0, 2), (1, 2), (2, 2)),]
    for coord in win_coord:
        a = coord[0]
        b = coord[1]
        c = coord[2]

        if field[a[0][a[1]]] == field[b[0][b[1]]] == field[c[0][c[1]]] != " ":
            print(f"Выиграл {field[b[0][b[1]]]}")
            return True
    return False

field = [
    [" ", "X", " "],
    [" ", "X", " "],
    [" ", "X", " "]
]
win()